In [128]:
#LOAD ALL 3 DATASETS

In [2]:
import pandas as pd

customers = pd.read_csv("customers.csv")
products  = pd.read_csv("products.csv")
sales     = pd.read_csv("sales.csv")

In [4]:
#UNDERSTAND THE CUSTOMERS DATASETS

In [5]:
customers.head()

,customer_id,first_name,last_name,email,phone,city,registration_date
0,C001,Rahul,Sharma,rahul.sharma@gmail.com,9876543210,Bangalore,2023-01-15
1,C002,Priya,Patel,priya.patel@yahoo.com,+91-9988776655,Mumbai,2023-02-20
2,C003,Amit,Kumar,NaN,9765432109,Delhi,2023-03-10
3,C004,Sneha,Reddy,sneha.reddy@gmail.com,9123456789,Hyderabad,15/04/2023
4,C005,Vikram,Singh,vikram.singh@outlook.com,09988112233,Chennai,2023-05-22

In [6]:
customers.shape #rows and columns

(26, 7)

In [7]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        26 non-null     object
 1   first_name         26 non-null     object
 2   last_name          26 non-null     object
 3   email              21 non-null     object
 4   phone              26 non-null     object
 5   city               26 non-null     object
 6   registration_date  26 non-null     object
dtypes: object(7)
memory usage: 1.6+ KB

In [8]:
customers.isnull().sum() #total 5 null values in email

customer_id          0
first_name           0
last_name            0
email                5
phone                0
city                 0
registration_date    0
dtype: int64

In [9]:
customers.describe()

,customer_id,first_name,last_name,email,phone,city,registration_date
count,26,26,26,21,26,26,26
unique,25,25,22,20,24,14,25
top,C001,Rahul,Sharma,rahul.sharma@gmail.com,9876543210,Bangalore,2023-01-15
freq,2,2,2,2,3,5,2

In [10]:
#UNDERSTAND THE PRODUCTS DATASET

In [11]:
products.head()

  product_id        product_name     category    price  stock_quantity
0       P001  Samsung Galaxy S21  Electronics  45999.0           150.0
1       P002  Nike Running Shoes      fashion   3499.0            80.0
2       P003   Apple MacBook Pro  ELECTRONICS      NaN            45.0
3       P004        Levi's Jeans      Fashion   2999.0           120.0
4       P005     Sony Headphones  electronics   1999.0           200.0

In [12]:
products.shape

(20, 5)

In [13]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      20 non-null     object
 1   product_name    20 non-null     object
 2   category        20 non-null     object
 3   price           17 non-null     float64
 4   stock_quantity  19 non-null     float64
dtypes: float64(2), object(3)
memory usage: 932.0+ bytes

In [14]:
products.describe()

              price  stock_quantity
count     17.000000       19.000000
mean   14141.529412      138.421053
std    22034.734645      114.565030
min      120.000000       35.000000
25%     1299.000000       65.000000
50%     2999.000000       95.000000
75%    12999.000000      175.000000
max    69999.000000      500.000000

In [15]:
products.isnull().sum() # 3 price nulls and SQ 1 null

product_id        0
product_name      0
category          0
price             3
stock_quantity    1
dtype: int64

In [16]:
#UNDERSTAND SALES DATASET

In [17]:
sales.head()

,transaction_id,customer_id,product_id,quantity,unit_price,transaction_date,status
0,T001,C001,P001,1,45999.0,2024-01-15,Completed
1,T002,C002,P004,2,2999.0,2024-01-16,Completed
2,T003,C003,P007,1,52999.0,15/01/2024,Completed
3,T004,NaN,P002,1,3499.0,2024-01-18,Pending
4,T005,C005,P009,3,650.0,2024-01-20,Completed

In [18]:
sales.shape

(41, 7)

In [19]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    41 non-null     object
 1   customer_id       38 non-null     object
 2   product_id        39 non-null     object
 3   quantity          41 non-null     int64
 4   unit_price        41 non-null     float64
 5   transaction_date  41 non-null     object
 6   status            41 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 2.4+ KB

In [20]:
sales.describe()

        quantity    unit_price
count  41.000000     41.000000
mean    2.195122  15453.780488
std     1.939323  22137.301015
min     1.000000    120.000000
25%     1.000000   1299.000000
50%     1.000000   2999.000000
75%     3.000000  32999.000000
max    10.000000  69999.000000

In [21]:
sales.isnull().sum() #3 null customerid and 2 productid

transaction_id      0
customer_id         3
product_id          2
quantity            0
unit_price          0
transaction_date    0
status              0
dtype: int64

In [22]:
# CLEANING THE ALL DATASETS

In [23]:
# 1.Remove duplicates record
customers.drop_duplicates(subset="customer_id", inplace=True)
products.drop_duplicates(subset="product_id", inplace=True)
sales.drop_duplicates(inplace=True)

In [24]:
# 2.handle missing values
customers['email'].fillna("not_provided", inplace=True)
customers.dropna(subset=['customer_id'], inplace=True)

In [25]:
products['category'].fillna("Unknown", inplace=True)

In [26]:
# 3.Standardize phone numbers

import re

def format_phone(phone):
    phone = re.sub(r'\D', '', str(phone))
    if len(phone) == 10:
        return "+91-" + phone
    elif len(phone) == 12 and phone.startswith("91"):
        return "+91-" + phone[2:]
    return None

customers['phone'] = customers['phone'].apply(format_phone)

In [27]:
# 4.Standardize category names

products['category'] = products['category'].str.strip().str.title()

In [28]:
# 5.Handle missing data

customers['registration_date'] = (
    customers['registration_date']
    .astype(str)
    .str.replace('/', '-', regex=False)
    .str.replace('.', '-', regex=False)
)

sales['transaction_date'] = (
   sales['transaction_date']
    .astype(str)
    .str.replace('/', '-', regex=False)
    .str.replace('.', '-', regex=False)
)

In [29]:
customers['registration_date'] = pd.to_datetime(
    customers['registration_date'],
    errors='coerce',
    dayfirst=True
).dt.strftime('%Y-%m-%d')

sales['transaction_date'] = pd.to_datetime(
    sales['transaction_date'],
    errors='coerce'
).dt.strftime('%Y-%m-%d')

/var/folders/yf/v3xgfc5s4j59lm_d1zz7bj8m0000gn/T/ipykernel_10972/3897661658.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  customers['registration_date'] = pd.to_datetime(

In [30]:
# 6.Add surrogate keys

In [31]:
customers.insert(0, 'customer_sk', range(1, len(customers) + 1))

In [32]:
products.insert(0, 'product_sk', range(1, len(products) + 1))

In [33]:
sales.insert(0, 'sales_sk', range(1, len(sales) + 1))

In [34]:
import mysql.connector

# Connect to MySQL (without specifying database yet)
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Boxing@386"
)

cursor = conn.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS etl_db")
conn.close()

In [35]:
from sqlalchemy import create_engine

engine = create_engine(
    "mysql+mysqlconnector://root:Boxing%40386@localhost:3306/etl_db"
)

customers.to_sql("customers", engine, if_exists="replace", index=False)
products.to_sql("products", engine, if_exists="replace", index=False)
sales.to_sql("sales", engine, if_exists="replace", index=False)

40

In [4]:
# ---------------------------
# DATA QUALITY REPORT
# ---------------------------

total_records = len(customers)
duplicates_removed = customers.duplicated().sum()
missing_values_handled = customers.isnull().sum().sum()
records_loaded = total_records - duplicates_removed

with open("data_quality_report.txt", "w") as f:
    f.write("DATA QUALITY REPORT\n")
    f.write("===================\n\n")

    f.write("Dataset: Customers\n")
    f.write(f"Records processed: {total_records}\n")
    f.write(f"Duplicates removed: {duplicates_removed}\n")
    f.write(f"Missing values handled: {missing_values_handled}\n")
    f.write(f"Records loaded successfully: {records_loaded}\n")

with open("data_quality_report.txt", "w") as f:
    f.write("DATA QUALITY REPORT\n")
    f.write("===================\n\n")

    f.write("Dataset: products\n")
    f.write(f"Records processed: {total_records}\n")
    f.write(f"Duplicates removed: {duplicates_removed}\n")
    f.write(f"Missing values handled: {missing_values_handled}\n")
    f.write(f"Records loaded successfully: {records_loaded}\n")

with open("data_quality_report.txt", "w") as f:
    f.write("DATA QUALITY REPORT\n")
    f.write("===================\n\n")

    f.write("Dataset: sales\n")
    f.write(f"Records processed: {total_records}\n")
    f.write(f"Duplicates removed: {duplicates_removed}\n")
    f.write(f"Missing values handled: {missing_values_handled}\n")
    f.write(f"Records loaded successfully: {records_loaded}\n")